In [0]:
import pandas as pd
data = pd.read_csv("a.csv")

In [0]:
data

   MATH  SCIENCE  HINDI  ENGLISH    SST
0     6      148   72.0     35.0    0.0
1     1       85   66.0     29.0    NaN
2     8      183   64.0      0.0    NaN
3     1       89   66.0     23.0   94.0
4     0      137   40.0     35.0  168.0
5     5      116   74.0      NaN    NaN
6     3       78   50.0     32.0   88.0
7    10      115    NaN      NaN    0.0
8     2      197   70.0     45.0  543.0
9     8      125   96.0      NaN    NaN

In [0]:
data.head(5)

   MATH  SCIENCE  HINDI  ENGLISH    SST
0     6      148   72.0     35.0    0.0
1     1       85   66.0     29.0    NaN
2     8      183   64.0      0.0    NaN
3     1       89   66.0     23.0   94.0
4     0      137   40.0     35.0  168.0

In [0]:
data.isna()

    MATH  SCIENCE  HINDI  ENGLISH    SST
0  False    False  False    False  False
1  False    False  False    False   True
2  False    False  False    False   True
3  False    False  False    False  False
4  False    False  False    False  False
5  False    False  False     True   True
6  False    False  False    False  False
7  False    False   True     True  False
8  False    False  False    False  False
9  False    False  False     True   True

In [0]:
data.isnull()

    MATH  SCIENCE  HINDI  ENGLISH    SST
0  False    False  False    False  False
1  False    False  False    False   True
2  False    False  False    False   True
3  False    False  False    False  False
4  False    False  False    False  False
5  False    False  False     True   True
6  False    False  False    False  False
7  False    False   True     True  False
8  False    False  False    False  False
9  False    False  False     True   True

In [0]:
df = data.dropna()
df

   MATH  SCIENCE  HINDI  ENGLISH    SST
0     6      148   72.0     35.0    0.0
3     1       89   66.0     23.0   94.0
4     0      137   40.0     35.0  168.0
6     3       78   50.0     32.0   88.0
8     2      197   70.0     45.0  543.0

In [0]:
df.iloc[:,3]

0    35.0
3    23.0
4    35.0
6    32.0
8    45.0
Name: ENGLISH, dtype: float64

In [0]:
df.loc[3,'MATH']

1

In [0]:
df.iloc[1,3]

23.0

In [0]:
data.fillna('0')

   MATH  SCIENCE HINDI ENGLISH  SST
0     6      148    72      35    0
1     1       85    66      29    0
2     8      183    64       0    0
3     1       89    66      23   94
4     0      137    40      35  168
5     5      116    74       0    0
6     3       78    50      32   88
7    10      115     0       0    0
8     2      197    70      45  543
9     8      125    96       0    0

In [0]:
df1 = pd.DataFrame({'ID':['A','B','C'], 'MARKS':[10,11,12]})

df2 = pd.DataFrame({'ID':['D','A','E'],'MARKS':[10,15,16]})

df=pd.merge(df1,df2)
df

Empty DataFrame
Columns: [ID, MARKS]
Index: []

In [0]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],'key2': ['one', 'two', 'one'],'lval': [1, 2, 3]})
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],'key2': ['one', 'one', 'one', 'two'],'rval': [4, 5, 6, 7]})

df=pd.merge(left,right)

In [46]:
df

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  bar  one     3     6

In [52]:
pd.concat([left,right],axis=1)

  key1 key2  lval key1 key2  rval
0  foo  one   1.0  foo  one     4
1  foo  two   2.0  foo  one     5
2  bar  one   3.0  bar  one     6
3  NaN  NaN   NaN  bar  two     7

In [56]:
pd.concat([df1,df2], ignore_index=True)

  ID  MARKS
0  A     10
1  B     11
2  C     12
3  D     10
4  A     15
5  E     16

In [58]:
pd.concat([left,right], ignore_index=False)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  key1 key2  lval  rval
0  foo  one   1.0   NaN
1  foo  two   2.0   NaN
2  bar  one   3.0   NaN
0  foo  one   NaN   4.0
1  foo  one   NaN   5.0
2  bar  one   NaN   6.0
3  bar  two   NaN   7.0